void main() {

    /* Задача №1
    0 1 2 3 4 5 6 7 8 9
    0 1 2 3 4 5 6 7 8
    0 1 2 3 4 5 6 7
    0 1 2 3 4 5 6
    0 1 2 3 4 5
    0 1 2 3 4
    0 1 2 3
    0 1 2
    0 1
    0 */

    for (int i = 9; i >= 0; i = i - 1) {

        for (int j = 0; j <= i; j = j + 1) {
            IO.print(j + " ");
        }

        IO.println();
    }


    /* Задача №2
    0 1 2 3 4 5 6 7 8 9
        0 1 2 3 4 5 6 7 8
            0 1 2 3 4 5 6 7
                0 1 2 3 4 5 6
                    0 1 2 3 4 5
                        0 1 2 3 4
                            0 1 2 3
                                0 1 2
                                    0 1
                                        0 */

    for (int i = 9; i >= 0; i = i - 1) {

        for (int j = 9; j > i; j = j - 1) {
            IO.print("\t");
        }

        for (int j = 0; j <= i; j = j + 1) {
            IO.print(j + " ");
        }

        IO.println();
    }

    /*Задача №3
    9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9
       8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8
          7 6 5 4 3 2 1 0 1 2 3 4 5 6 7
             6 5 4 3 2 1 0 1 2 3 4 5 6
                5 4 3 2 1 0 1 2 3 4 5
                   4 3 2 1 0 1 2 3 4
                      3 2 1 0 1 2 3
                         2 1 0 1 2
                            1 0 1
                               0  */

    for (int i = 9; i >= 0; i = i - 1) {

        for (int j = 9; j > i; j = j - 1) {
            IO.print("\t");
        }

        for (int j = i; j >= 0; j = j - 1) {
            IO.print(j + " ");
        }

        for (int j = 1; j <= i; j = j + 1) {
            IO.print(j + " ");
        }

        IO.println();
    }
}